thanks4opensource/regbits/unittest/arm/cortex_m7/stm/stm32f767xx/stm32f767xx_ram_init.c
#include <stdint.h>

#include <stm32f767xx.h>


#if 0   // now in Makefile
#define ALL_HANDLERS_DEFAULT
#define WEAK_FUNCTIONS
#endif


void    init(void);
#ifdef ALL_HANDLERS_DEFAULT
void    Default_Handler             (void);
#else
/* ARM interrupt handlers */
void
NMI_IRQ_Handler               (void), /* -14                                   */
HardFault_IRQ_Handler         (void), /* -13 (not in stm32f767xx.h             */
MemManage_IRQ_Handler         (void), /* -12                                   */
BusFault_IRQ_Handler          (void), /* -11                                   */
UsageFault_IRQ_Handler        (void), /* -10                                   */
Reserved1_IRQ_Handler         (void), /*  -9                                   */
Reserved2_IRQ_Handler         (void), /*  -8                                   */
Reserved3_IRQ_Handler         (void), /*  -7                                   */
Reserved4_IRQ_Handler         (void), /*  -6                                   */
SVCall_IRQ_Handler            (void), /*  -5                                   */
Debug_IRQ_Handler             (void), /*  -4                                   */
Reserved5_IRQ_Handler         (void), /*  -3                                   */
PendSV_IRQ_Handler            (void), /*  -2                                   */
SysTick_IRQ_Handler           (void), /*  -1                                   */
/* STM32F767xx-specific interrupt handlers */
WWDG_IRQ_Handler              (void), /*    0  Window WatchDog                 */
PVD_IRQ_Handler               (void), /*    1  PVD through EXTI Line detection */
TAMP_STAMP_IRQ_Handler        (void), /*    2  Tamper and TimeStamp interrupts through the EXTI */
RTC_WKUP_IRQ_Handler          (void), /*    3  RTC Wakeup interrupt through the EXTI */
FLASH_IRQ_Handler             (void), /*    4  FLASH global                    */
RCC_IRQ_Handler               (void), /*    5  RCC global                      */
EXTI0_IRQ_Handler             (void), /*    6  EXTI Line0                      */
EXTI1_IRQ_Handler             (void), /*    7  EXTI Line1                      */
EXTI2_IRQ_Handler             (void), /*    8  EXTI Line2                      */
EXTI3_IRQ_Handler             (void), /*    9  EXTI Line3                      */
EXTI4_IRQ_Handler             (void), /*   10  EXTI Line4                      */
DMA1_Stream0_IRQ_Handler      (void), /*   11  DMA1 Stream 0 global            */
DMA1_Stream1_IRQ_Handler      (void), /*   12  DMA1 Stream 1 global            */
DMA1_Stream2_IRQ_Handler      (void), /*   13  DMA1 Stream 2 global            */
DMA1_Stream3_IRQ_Handler      (void), /*   14  DMA1 Stream 3 global            */
DMA1_Stream4_IRQ_Handler      (void), /*   15  DMA1 Stream 4 global            */
DMA1_Stream5_IRQ_Handler      (void), /*   16  DMA1 Stream 5 global            */
DMA1_Stream6_IRQ_Handler      (void), /*   17  DMA1 Stream 6 global            */
ADC_IRQ_Handler               (void), /*   18  ADC1 ADC2 and ADC3 global       */
CAN1_TX_IRQ_Handler           (void), /*   19  CAN1 TX                         */
CAN1_RX0_IRQ_Handler          (void), /*   20  CAN1 RX0                        */
CAN1_RX1_IRQ_Handler          (void), /*   21  CAN1 RX1                        */
CAN1_SCE_IRQ_Handler          (void), /*   22  CAN1 SCE                        */
EXTI9_5_IRQ_Handler           (void), /*   23  External Line[9:5]              */
TIM1_BRK_TIM9_IRQ_Handler     (void), /*   24  TIM1 Break interrupt and TIM9 global */
TIM1_UP_TIM10_IRQ_Handler     (void), /*   25  TIM1 Update Interrupt and TIM10 global */
TIM1_TRG_COM_TIM11_IRQ_Handler(void), /*   26  TIM1 Trigger and Commutation Interrupt and TIM11 global */
TIM1_CC_IRQ_Handler           (void), /*   27  TIM1 Capture Compare            */
TIM2_IRQ_Handler              (void), /*   28  TIM2 global                     */
TIM3_IRQ_Handler              (void), /*   29  TIM3 global                     */
TIM4_IRQ_Handler              (void), /*   30  TIM4 global                     */
I2C1_EV_IRQ_Handler           (void), /*   31  I2C1 Event                      */
I2C1_ER_IRQ_Handler           (void), /*   32  I2C1 Error                      */
I2C2_EV_IRQ_Handler           (void), /*   33  I2C2 Event                      */
I2C2_ER_IRQ_Handler           (void), /*   34  I2C2 Error                      */
SPI1_IRQ_Handler              (void), /*   35  SPI1 global                     */
SPI2_IRQ_Handler              (void), /*   36  SPI2 global                     */
USART1_IRQ_Handler            (void), /*   37  USART1 global                   */
USART2_IRQ_Handler            (void), /*   38  USART2 global                       */
USART3_IRQ_Handler            (void), /*   39  USART3 global                       */
EXTI15_10_IRQ_Handler         (void), /*   40  External Line[15:10]            */
RTC_Alarm_IRQ_Handler         (void), /*   41  RTC Alarm (A and B) through EXTI Line */
OTG_FS_WKUP_IRQ_Handler       (void), /*   42  USB OTG FS Wakeup through EXTI line */
TIM8_BRK_TIM12_IRQ_Handler    (void), /*   43    TIM8 Break Interrupt and TIM12 global */
TIM8_UP_TIM13_IRQ_Handler     (void), /*   44  TIM8 Update Interrupt and TIM13 global */
TIM8_TRG_COM_TIM14_IRQ_Handler(void), /*   45    TIM8 Trigger and Commutation Interrupt and TIM14 global */
TIM8_CC_IRQ_Handler           (void), /*   46  TIM8 Capture Compare            */
DMA1_Stream7_IRQ_Handler      (void), /*   47  DMA1 Stream7                    */
FMC_IRQ_Handler               (void), /*   48  FMC global                      */
SDMMC1_IRQ_Handler            (void), /*   49  SDMMC1 global                       */
TIM5_IRQ_Handler              (void), /*   50  TIM5 global                     */
SPI3_IRQ_Handler              (void), /*   51  SPI3 global                     */
UART4_IRQ_Handler             (void), /*   52  UART4 global                    */
UART5_IRQ_Handler             (void), /*   53  UART5 global                    */
TIM6_DAC_IRQ_Handler          (void), /*   54  TIM6 global and DAC1&2 underrun error */
TIM7_IRQ_Handler              (void), /*   55  TIM7 global                     */
DMA2_Stream0_IRQ_Handler      (void), /*   56  DMA2 Stream 0 global            */
DMA2_Stream1_IRQ_Handler      (void), /*   57  DMA2 Stream 1 global            */
DMA2_Stream2_IRQ_Handler      (void), /*   58  DMA2 Stream 2 global            */
DMA2_Stream3_IRQ_Handler      (void), /*   59  DMA2 Stream 3 global            */
DMA2_Stream4_IRQ_Handler      (void), /*   60  DMA2 Stream 4 global            */
ETH_IRQ_Handler               (void), /*   61  Ethernet global                 */
ETH_WKUP_IRQ_Handler          (void), /*   62  Ethernet Wakeup through EXTI line*/
CAN2_TX_IRQ_Handler           (void), /*   63  CAN2 TX                         */
CAN2_RX0_IRQ_Handler          (void), /*   64  CAN2 RX0                        */
CAN2_RX1_IRQ_Handler          (void), /*   65  CAN2 RX1                        */
CAN2_SCE_IRQ_Handler          (void), /*   66  CAN2 SCE                        */
OTG_FS_IRQ_Handler            (void), /*   67  USB OTG FS global               */
DMA2_Stream5_IRQ_Handler      (void), /*   68  DMA2 Stream 5 global            */
DMA2_Stream6_IRQ_Handler      (void), /*   69  DMA2 Stream 6 global            */
DMA2_Stream7_IRQ_Handler      (void), /*   70  DMA2 Stream 7 global            */
USART6_IRQ_Handler            (void), /*   71  USART6 global                   */
I2C3_EV_IRQ_Handler           (void), /*   72  I2C3 event                      */
I2C3_ER_IRQ_Handler           (void), /*   73  I2C3 error                      */
OTG_HS_EP1_OUT_IRQ_Handler    (void), /*   74  USB OTG HS End Point 1 Out global*/
OTG_HS_EP1_IN_IRQ_Handler     (void), /*   75  USB OTG HS End Point 1 In global*/
OTG_HS_WKUP_IRQ_Handler       (void), /*   76  USB OTG HS Wakeup through EXTI  */
OTG_HS_IRQ_Handler            (void), /*   77  USB OTG HS global               */
DCMI_IRQ_Handler              (void), /*   78  DCMI global                     */
RNG_IRQ_Handler               (void), /*   80  RNG global                      */
FPU_IRQ_Handler               (void), /*   81  FPU global                      */
UART7_IRQ_Handler             (void), /*   82  UART7 global                    */
UART8_IRQ_Handler             (void), /*   83  UART8 global                    */
SPI4_IRQ_Handler              (void), /*   84  SPI4 global                     */
SPI5_IRQ_Handler              (void), /*   85  SPI5 global                     */
SPI6_IRQ_Handler              (void), /*   86  SPI6 global                     */
SAI1_IRQ_Handler              (void), /*   87  SAI1 global                     */
LTDC_IRQ_Handler              (void), /*   88  LTDC global                     */
LTDC_ER_IRQ_Handler           (void), /*   89  LTDC Error global               */
DMA2D_IRQ_Handler             (void), /*   90  DMA2D global                    */
SAI2_IRQ_Handler              (void), /*   91  SAI2 global                     */
QUADSPI_IRQ_Handler           (void), /*   92  Quad SPI global                 */
LPTIM1_IRQ_Handler            (void), /*   93  LP TIM1                         */
CEC_IRQ_Handler               (void), /*   94  HDMI-CEC global                 */
I2C4_EV_IRQ_Handler           (void), /*   95  I2C4 Event                      */
I2C4_ER_IRQ_Handler           (void), /*   96  I2C4 Error                      */
SPDIF_RX_IRQ_Handler          (void), /*   97  SPDIF-RX global                 */
DFSDM1_FLT0_IRQ_Handler       (void), /*   99  DFSDM1 Filter 0 global          */
DFSDM1_FLT1_IRQ_Handler       (void), /*  100  DFSDM1 Filter 1 global          */
DFSDM1_FLT2_IRQ_Handler       (void), /*  101  DFSDM1 Filter 2 global          */
DFSDM1_FLT3_IRQ_Handler       (void), /*  102  DFSDM1 Filter 3 global          */
SDMMC2_IRQ_Handler            (void), /*  103  SDMMC2 global                   */
CAN3_TX_IRQ_Handler           (void), /*  104  CAN3 TX                         */
CAN3_RX0_IRQ_Handler          (void), /*  105  CAN3 RX0                        */
CAN3_RX1_IRQ_Handler          (void), /*  106  CAN3 RX1                        */
CAN3_SCE_IRQ_Handler          (void), /*  107  CAN3 SCE                        */
JPEG_IRQ_Handler              (void), /*  108  JPEG global                     */
MDIOS_IRQ_Handler             (void); /*  109  MDIO Slave global               */
#endif  // #ifdef ALL_HANDLERS_DEFAULT


int     main(void);

// The following are 'declared' in the linker script
extern uint8_t  BSS_START;
extern uint8_t  BSS_END;
extern uint8_t  TOP_OF_STACK;



