thanks4opensource/regbits/unittest/arm/cortex_m7/stm/stm32f767xx/stm32f767xx_ram_init.c
// the section "vectors" is placed at the beginning of ram
// by the linker script
void *INTERRUPT_VECTORS[] __attribute__((section(".vectors"))) = {
    (void *)&TOP_OF_STACK,  /* Top of stack, base + 96K = 0x20018000*/
    init,                   /* Reset Handler */
#ifdef ALL_HANDLERS_DEFAULT
/* ARM interrupt handlers */
    Default_Handler,    /* NMI                              -14               */
    Default_Handler,    /* Hard Fault (not in stm32f767xx)  -13               */
    Default_Handler,    /* MemManage                        -12               */
    Default_Handler,    /* BusFault                         -11               */
    Default_Handler,    /* UsageFault                       -10               */
    Default_Handler,    /* Reserved                          -9               */
    Default_Handler,    /* Reserved                          -8               */
    Default_Handler,    /* Reserved                          -7               */
    Default_Handler,    /* Reserved                          -6               */
    Default_Handler,    /* SVCall                            -5               */
    Default_Handler,    /* Debug                             -4               */
    Default_Handler,    /* Reserved                          -3               */
    Default_Handler,    /* PendSV                            -2               */
    Default_Handler,    /* SysTick                           -1               */
/* STM32F767xx-specific interrupt handlers */
    DefaultHandler,     /* WWDG_IRQ_Handler                   0               */
    DefaultHandler,     /* PVD_IRQ_Handler                    1               */
    DefaultHandler,     /* TAMP_STAMP_IRQ_Handler             2               */
    DefaultHandler,     /* RTC_WKUP_IRQ_Handler               3               */
    DefaultHandler,     /* FLASH_IRQ_Handler                  4               */
    DefaultHandler,     /* RCC_IRQ_Handler                    5               */
    DefaultHandler,     /* EXTI0_IRQ_Handler                  6               */
    DefaultHandler,     /* EXTI1_IRQ_Handler                  7               */
    DefaultHandler,     /* EXTI2_IRQ_Handler                  8               */
    DefaultHandler,     /* EXTI3_IRQ_Handler                  9               */
    DefaultHandler,     /* EXTI4_IRQ_Handler                 10               */
    DefaultHandler,     /* DMA1_Stream0_IRQ_Handler          11               */
    DefaultHandler,     /* DMA1_Stream1_IRQ_Handler          12               */
    DefaultHandler,     /* DMA1_Stream2_IRQ_Handler          13               */
    DefaultHandler,     /* DMA1_Stream3_IRQ_Handler          14               */
    DefaultHandler,     /* DMA1_Stream4_IRQ_Handler          15               */
    DefaultHandler,     /* DMA1_Stream5_IRQ_Handler          16               */
    DefaultHandler,     /* DMA1_Stream6_IRQ_Handler          17               */
    DefaultHandler,     /* ADC_IRQ_Handler                   18               */
    DefaultHandler,     /* CAN1_TX_IRQ_Handler               19               */
    DefaultHandler,     /* CAN1_RX0_IRQ_Handler              20               */
    DefaultHandler,     /* CAN1_RX1_IRQ_Handler              21               */
    DefaultHandler,     /* CAN1_SCE_IRQ_Handler              22               */
    DefaultHandler,     /* EXTI9_5_IRQ_Handler               23               */
    DefaultHandler,     /* TIM1_BRK_TIM9_IRQ_Handler         24               */
    DefaultHandler,     /* TIM1_UP_TIM10_IRQ_Handler         25               */
    DefaultHandler,     /* TIM1_TRG_COM_TIM11_IRQ_Handler    26               */
    DefaultHandler,     /* TIM1_CC_IRQ_Handler               27               */
    DefaultHandler,     /* TIM2_IRQ_Handler                  28               */
    DefaultHandler,     /* TIM3_IRQ_Handler                  29               */
    DefaultHandler,     /* TIM4_IRQ_Handler                  30               */
    DefaultHandler,     /* I2C1_EV_IRQ_Handler               31               */
    DefaultHandler,     /* I2C1_ER_IRQ_Handler               32               */
    DefaultHandler,     /* I2C2_EV_IRQ_Handler               33               */
    DefaultHandler,     /* I2C2_ER_IRQ_Handler               34               */
    DefaultHandler,     /* SPI1_IRQ_Handler                  35               */
    DefaultHandler,     /* SPI2_IRQ_Handler                  36               */
    DefaultHandler,     /* USART1_IRQ_Handler                37               */
    DefaultHandler,     /* USART2_IRQ_Handler                38               */
    DefaultHandler,     /* USART3_IRQ_Handler                39               */
    DefaultHandler,     /* EXTI15_10_IRQ_Handler             40               */
    DefaultHandler,     /* RTC_Alarm_IRQ_Handler             41               */
    DefaultHandler,     /* OTG_FS_WKUP_IRQ_Handler           42               */
    DefaultHandler,     /* TIM8_BRK_TIM12_IRQ_Handler        43               */
    DefaultHandler,     /* TIM8_UP_TIM13_IRQ_Handler         44               */
    DefaultHandler,     /* TIM8_TRG_COM_TIM14_IRQ_Handler    45               */
    DefaultHandler,     /* TIM8_CC_IRQ_Handler               46               */
    DefaultHandler,     /* DMA1_Stream7_IRQ_Handler          47               */
    DefaultHandler,     /* FMC_IRQ_Handler                   48               */
    DefaultHandler,     /* SDMMC1_IRQ_Handler                49               */
    DefaultHandler,     /* TIM5_IRQ_Handler                  50               */
    DefaultHandler,     /* SPI3_IRQ_Handler                  51               */
    DefaultHandler,     /* UART4_IRQ_Handler                 52               */
    DefaultHandler,     /* UART5_IRQ_Handler                 53               */
    DefaultHandler,     /* TIM6_DAC_IRQ_Handler              54               */
    DefaultHandler,     /* TIM7_IRQ_Handler                  55               */
    DefaultHandler,     /* DMA2_Stream0_IRQ_Handler          56               */
    DefaultHandler,     /* DMA2_Stream1_IRQ_Handler          57               */
    DefaultHandler,     /* DMA2_Stream2_IRQ_Handler          58               */
    DefaultHandler,     /* DMA2_Stream3_IRQ_Handler          59               */
    DefaultHandler,     /* DMA2_Stream4_IRQ_Handler          60               */
    DefaultHandler,     /* ETH_IRQ_Handler                   61               */
    DefaultHandler,     /* ETH_WKUP_IRQ_Handler              62               */
    DefaultHandler,     /* CAN2_TX_IRQ_Handler               63               */
    DefaultHandler,     /* CAN2_RX0_IRQ_Handler              64               */
    DefaultHandler,     /* CAN2_RX1_IRQ_Handler              65               */
    DefaultHandler,     /* CAN2_SCE_IRQ_Handler              66               */
    DefaultHandler,     /* OTG_FS_IRQ_Handler                67               */
    DefaultHandler,     /* DMA2_Stream5_IRQ_Handler          68               */
    DefaultHandler,     /* DMA2_Stream6_IRQ_Handler          69               */
    DefaultHandler,     /* DMA2_Stream7_IRQ_Handler          70               */
    DefaultHandler,     /* USART6_IRQ_Handler                71               */
    DefaultHandler,     /* I2C3_EV_IRQ_Handler               72               */
    DefaultHandler,     /* I2C3_ER_IRQ_Handler               73               */
    DefaultHandler,     /* OTG_HS_EP1_OUT_IRQ_Handler        74               */
    DefaultHandler,     /* OTG_HS_EP1_IN_IRQ_Handler         75               */
    DefaultHandler,     /* OTG_HS_WKUP_IRQ_Handler           76               */
    DefaultHandler,     /* OTG_HS_IRQ_Handler                77               */
    DefaultHandler,     /* DCMI_IRQ_Handler                  78               */
    DefaultHandler,     /* RNG_IRQ_Handler                   80               */
    DefaultHandler,     /* FPU_IRQ_Handler                   81               */
    DefaultHandler,     /* UART7_IRQ_Handler                 82               */
    DefaultHandler,     /* UART8_IRQ_Handler                 83               */
    DefaultHandler,     /* SPI4_IRQ_Handler                  84               */
    DefaultHandler,     /* SPI5_IRQ_Handler                  85               */
    DefaultHandler,     /* SPI6_IRQ_Handler                  86               */
    DefaultHandler,     /* SAI1_IRQ_Handler                  87               */
    DefaultHandler,     /* LTDC_IRQ_Handler                  88               */
    DefaultHandler,     /* LTDC_ER_IRQ_Handler               89               */
    DefaultHandler,     /* DMA2D_IRQ_Handler                 90               */
    DefaultHandler,     /* SAI2_IRQ_Handler                  91               */
    DefaultHandler,     /* QUADSPI_IRQ_Handler               92               */
    DefaultHandler,     /* LPTIM1_IRQ_Handler                93               */
    DefaultHandler,     /* CEC_IRQ_Handler                   94               */
    DefaultHandler,     /* I2C4_EV_IRQ_Handler               95               */
    DefaultHandler,     /* I2C4_ER_IRQ_Handler               96               */
    DefaultHandler,     /* SPDIF_RX_IRQ_Handler              97               */
    DefaultHandler,     /* DFSDM1_FLT0_IRQ_Handler           99               */
    DefaultHandler,     /* DFSDM1_FLT1_IRQ_Handler          100               */
    DefaultHandler,     /* DFSDM1_FLT2_IRQ_Handler          101               */
    DefaultHandler,     /* DFSDM1_FLT3_IRQ_Handler          102               */
    DefaultHandler,     /* SDMMC2_IRQ_Handler               103               */
    DefaultHandler,     /* CAN3_TX_IRQ_Handler              104               */
    DefaultHandler,     /* CAN3_RX0_IRQ_Handler             105               */
    DefaultHandler,     /* CAN3_RX1_IRQ_Handler             106               */
    DefaultHandler,     /* CAN3_SCE_IRQ_Handler             107               */
    DefaultHandler,     /* JPEG_IRQ_Handler                 108               */
    DefaultHandler,     /* MDIOS_IRQ_Handler                109               */
#else
/* ARM interrupt handlers */
    NMI_IRQ_Handler,                /* -14  NMI                     */
    HardFault_IRQ_Handler,          /* -13  Hard                    */
    MemManage_IRQ_Handler,          /* -12  MemManage               */
    BusFault_IRQ_Handler,           /* -11  BusFault                */
    UsageFault_IRQ_Handler,         /* -10  UsageFault              */
    Reserved1_IRQ_Handler,          /*  -9  Reserved                */
    Reserved2_IRQ_Handler,          /*  -8  Reserved                */
    Reserved3_IRQ_Handler,          /*  -7  Reserved                */
    Reserved4_IRQ_Handler,          /*  -6  Reserved                */
    SVCall_IRQ_Handler,             /*  -5  SVCall                  */
    Debug_IRQ_Handler,              /*  -4  Debug                   */
    Reserved5_IRQ_Handler,          /*  -3  Reserved                */
    PendSV_IRQ_Handler,             /*  -2  PendSV                  */
    SysTick_IRQ_Handler,            /*  -1  SysTick                 */
/* STM32F767xx-specific interrupt handlers */
    WWDG_IRQ_Handler,                   /*   0  */
    PVD_IRQ_Handler,                    /*   1  */
    TAMP_STAMP_IRQ_Handler,             /*   2  */
    RTC_WKUP_IRQ_Handler,               /*   3  */
    FLASH_IRQ_Handler,                  /*   4  */
    RCC_IRQ_Handler,                    /*   5  */
    EXTI0_IRQ_Handler,                  /*   6  */
    EXTI1_IRQ_Handler,                  /*   7  */
    EXTI2_IRQ_Handler,                  /*   8  */
    EXTI3_IRQ_Handler,                  /*   9  */
    EXTI4_IRQ_Handler,                  /*  10  */
    DMA1_Stream0_IRQ_Handler,           /*  11  */
    DMA1_Stream1_IRQ_Handler,           /*  12  */
    DMA1_Stream2_IRQ_Handler,           /*  13  */
    DMA1_Stream3_IRQ_Handler,           /*  14  */
    DMA1_Stream4_IRQ_Handler,           /*  15  */
    DMA1_Stream5_IRQ_Handler,           /*  16  */
    DMA1_Stream6_IRQ_Handler,           /*  17  */
    ADC_IRQ_Handler,                    /*  18  */
    CAN1_TX_IRQ_Handler,                /*  19  */
    CAN1_RX0_IRQ_Handler,               /*  20  */
    CAN1_RX1_IRQ_Handler,               /*  21  */
    CAN1_SCE_IRQ_Handler,               /*  22  */
    EXTI9_5_IRQ_Handler,                /*  23  */
    TIM1_BRK_TIM9_IRQ_Handler,          /*  24  */
    TIM1_UP_TIM10_IRQ_Handler,          /*  25  */
    TIM1_TRG_COM_TIM11_IRQ_Handler,     /*  26  */
    TIM1_CC_IRQ_Handler,                /*  27  */
    TIM2_IRQ_Handler,                   /*  28  */
    TIM3_IRQ_Handler,                   /*  29  */
    TIM4_IRQ_Handler,                   /*  30  */
    I2C1_EV_IRQ_Handler,                /*  31  */
    I2C1_ER_IRQ_Handler,                /*  32  */
    I2C2_EV_IRQ_Handler,                /*  33  */
    I2C2_ER_IRQ_Handler,                /*  34  */
    SPI1_IRQ_Handler,                   /*  35  */
    SPI2_IRQ_Handler,                   /*  36  */
    USART1_IRQ_Handler,                 /*  37  */
    USART2_IRQ_Handler,                 /*  38  */
    USART3_IRQ_Handler,                 /*  39  */
    EXTI15_10_IRQ_Handler,              /*  40  */
    RTC_Alarm_IRQ_Handler,              /*  41  */
    OTG_FS_WKUP_IRQ_Handler,            /*  42  */
    TIM8_BRK_TIM12_IRQ_Handler,         /*  43  */
    TIM8_UP_TIM13_IRQ_Handler,          /*  44  */
    TIM8_TRG_COM_TIM14_IRQ_Handler,     /*  45  */
    TIM8_CC_IRQ_Handler,                /*  46  */
    DMA1_Stream7_IRQ_Handler,           /*  47  */
    FMC_IRQ_Handler,                    /*  48  */
    SDMMC1_IRQ_Handler,                 /*  49  */
    TIM5_IRQ_Handler,                   /*  50  */
    SPI3_IRQ_Handler,                   /*  51  */
    UART4_IRQ_Handler,                  /*  52  */
    UART5_IRQ_Handler,                  /*  53  */
    TIM6_DAC_IRQ_Handler,               /*  54  */
    TIM7_IRQ_Handler,                   /*  55  */
    DMA2_Stream0_IRQ_Handler,           /*  56  */
    DMA2_Stream1_IRQ_Handler,           /*  57  */
    DMA2_Stream2_IRQ_Handler,           /*  58  */
    DMA2_Stream3_IRQ_Handler,           /*  59  */
    DMA2_Stream4_IRQ_Handler,           /*  60  */
    ETH_IRQ_Handler,                    /*  61  */
    ETH_WKUP_IRQ_Handler,               /*  62  */
    CAN2_TX_IRQ_Handler,                /*  63  */
    CAN2_RX0_IRQ_Handler,               /*  64  */
    CAN2_RX1_IRQ_Handler,               /*  65  */
    CAN2_SCE_IRQ_Handler,               /*  66  */
    OTG_FS_IRQ_Handler,                 /*  67  */
    DMA2_Stream5_IRQ_Handler,           /*  68  */
    DMA2_Stream6_IRQ_Handler,           /*  69  */
    DMA2_Stream7_IRQ_Handler,           /*  70  */
    USART6_IRQ_Handler,                 /*  71  */
    I2C3_EV_IRQ_Handler,                /*  72  */
    I2C3_ER_IRQ_Handler,                /*  73  */
    OTG_HS_EP1_OUT_IRQ_Handler,         /*  74  */
    OTG_HS_EP1_IN_IRQ_Handler,          /*  75  */
    OTG_HS_WKUP_IRQ_Handler,            /*  76  */
    OTG_HS_IRQ_Handler,                 /*  77  */
    DCMI_IRQ_Handler,                   /*  78  */
    RNG_IRQ_Handler,                    /*  80  */
    FPU_IRQ_Handler,                    /*  81  */
    UART7_IRQ_Handler,                  /*  82  */
    UART8_IRQ_Handler,                  /*  83  */
    SPI4_IRQ_Handler,                   /*  84  */
    SPI5_IRQ_Handler,                   /*  85  */
    SPI6_IRQ_Handler,                   /*  86  */
    SAI1_IRQ_Handler,                   /*  87  */
    LTDC_IRQ_Handler,                   /*  88  */
    LTDC_ER_IRQ_Handler,                /*  89  */
    DMA2D_IRQ_Handler,                  /*  90  */
    SAI2_IRQ_Handler,                   /*  91  */
    QUADSPI_IRQ_Handler,                /*  92  */
    LPTIM1_IRQ_Handler,                 /*  93  */
    CEC_IRQ_Handler,                    /*  94  */
    I2C4_EV_IRQ_Handler,                /*  95  */
    I2C4_ER_IRQ_Handler,                /*  96  */
    SPDIF_RX_IRQ_Handler,               /*  97  */
    DFSDM1_FLT0_IRQ_Handler,            /*  99  */
    DFSDM1_FLT1_IRQ_Handler,            /* 100  */
    DFSDM1_FLT2_IRQ_Handler,            /* 101  */
    DFSDM1_FLT3_IRQ_Handler,            /* 102  */
    SDMMC2_IRQ_Handler,                 /* 103  */
    CAN3_TX_IRQ_Handler,                /* 104  */
    CAN3_RX0_IRQ_Handler,               /* 105  */
    CAN3_RX1_IRQ_Handler,               /* 106  */
    CAN3_SCE_IRQ_Handler,               /* 107  */
    JPEG_IRQ_Handler,                   /* 108  */
    MDIOS_IRQ_Handler,                  /* 109  */
#endif
};



void init()
{
    uint8_t     *dest;
    uint32_t     len;

