thanks4opensource/regbits/unittest/arm/cortex_m7/stm/stm32f767xx/stm32f767xx_ram_init.c
    // zero out the uninitialized global/static variables
    dest = &BSS_START;
    len  = &BSS_END - &BSS_START;
    while (len--)
        *dest++=0;

    // set CPU's vector table address
    SCB->VTOR = (uint32_t)INTERRUPT_VECTORS;

    // start program
    main();
}



#ifdef WEAK_FUNCTIONS
#define MAYBE_WEAK __attribute__((weak))
#else
#define MAYBE_WEAK
#endif


#ifdef ALL_HANDLERS_DEFAULT
MAYBE_WEAK void Default_Handler()
{
    while(1);
}
#else
/* ARM interrupt handlers */
MAYBE_WEAK void NMI_IRQ_Handler                 () { while (1); }   /* -14  */
MAYBE_WEAK void HardFault_IRQ_Handler           () { while (1); }   /* -13  */
MAYBE_WEAK void MemManage_IRQ_Handler           () { while (1); }   /* -12  */
MAYBE_WEAK void BusFault_IRQ_Handler            () { while (1); }   /* -11  */
MAYBE_WEAK void UsageFault_IRQ_Handler          () { while (1); }   /* -10  */
MAYBE_WEAK void Reserved1_IRQ_Handler           () { while (1); }   /*  -9  */
MAYBE_WEAK void Reserved2_IRQ_Handler           () { while (1); }   /*  -8  */
MAYBE_WEAK void Reserved3_IRQ_Handler           () { while (1); }   /*  -7  */
MAYBE_WEAK void Reserved4_IRQ_Handler           () { while (1); }   /*  -6  */
MAYBE_WEAK void SVCall_IRQ_Handler              () { while (1); }   /*  -5  */
MAYBE_WEAK void Debug_IRQ_Handler               () { while (1); }   /*  -4  */
MAYBE_WEAK void Reserved5_IRQ_Handler           () { while (1); }   /*  -3  */
MAYBE_WEAK void PendSV_IRQ_Handler              () { while (1); }   /*  -2  */
MAYBE_WEAK void SysTick_IRQ_Handler             () { while (1); }   /*  -1  */
/* STM32F767xx-specific interrupt handlers */
MAYBE_WEAK void WWDG_IRQ_Handler                () { while (1); }   /*   0  */
MAYBE_WEAK void PVD_IRQ_Handler                 () { while (1); }   /*   1  */
MAYBE_WEAK void TAMP_STAMP_IRQ_Handler          () { while (1); }   /*   2  */
MAYBE_WEAK void RTC_WKUP_IRQ_Handler            () { while (1); }   /*   3  */
MAYBE_WEAK void FLASH_IRQ_Handler               () { while (1); }   /*   4  */
MAYBE_WEAK void RCC_IRQ_Handler                 () { while (1); }   /*   5  */
MAYBE_WEAK void EXTI0_IRQ_Handler               () { while (1); }   /*   6  */
MAYBE_WEAK void EXTI1_IRQ_Handler               () { while (1); }   /*   7  */
MAYBE_WEAK void EXTI2_IRQ_Handler               () { while (1); }   /*   8  */
MAYBE_WEAK void EXTI3_IRQ_Handler               () { while (1); }   /*   9  */
MAYBE_WEAK void EXTI4_IRQ_Handler               () { while (1); }   /*  10  */
MAYBE_WEAK void DMA1_Stream0_IRQ_Handler        () { while (1); }   /*  11  */
MAYBE_WEAK void DMA1_Stream1_IRQ_Handler        () { while (1); }   /*  12  */
MAYBE_WEAK void DMA1_Stream2_IRQ_Handler        () { while (1); }   /*  13  */
MAYBE_WEAK void DMA1_Stream3_IRQ_Handler        () { while (1); }   /*  14  */
MAYBE_WEAK void DMA1_Stream4_IRQ_Handler        () { while (1); }   /*  15  */
MAYBE_WEAK void DMA1_Stream5_IRQ_Handler        () { while (1); }   /*  16  */
MAYBE_WEAK void DMA1_Stream6_IRQ_Handler        () { while (1); }   /*  17  */
MAYBE_WEAK void ADC_IRQ_Handler                 () { while (1); }   /*  18  */
MAYBE_WEAK void CAN1_TX_IRQ_Handler             () { while (1); }   /*  19  */
MAYBE_WEAK void CAN1_RX0_IRQ_Handler            () { while (1); }   /*  20  */
MAYBE_WEAK void CAN1_RX1_IRQ_Handler            () { while (1); }   /*  21  */
MAYBE_WEAK void CAN1_SCE_IRQ_Handler            () { while (1); }   /*  22  */
MAYBE_WEAK void EXTI9_5_IRQ_Handler             () { while (1); }   /*  23  */
MAYBE_WEAK void TIM1_BRK_TIM9_IRQ_Handler       () { while (1); }   /*  24  */
MAYBE_WEAK void TIM1_UP_TIM10_IRQ_Handler       () { while (1); }   /*  25  */
MAYBE_WEAK void TIM1_TRG_COM_TIM11_IRQ_Handler  () { while (1); }   /*  26  */
MAYBE_WEAK void TIM1_CC_IRQ_Handler             () { while (1); }   /*  27  */
MAYBE_WEAK void TIM2_IRQ_Handler                () { while (1); }   /*  28  */
MAYBE_WEAK void TIM3_IRQ_Handler                () { while (1); }   /*  29  */
MAYBE_WEAK void TIM4_IRQ_Handler                () { while (1); }   /*  30  */
MAYBE_WEAK void I2C1_EV_IRQ_Handler             () { while (1); }   /*  31  */
MAYBE_WEAK void I2C1_ER_IRQ_Handler             () { while (1); }   /*  32  */
MAYBE_WEAK void I2C2_EV_IRQ_Handler             () { while (1); }   /*  33  */
MAYBE_WEAK void I2C2_ER_IRQ_Handler             () { while (1); }   /*  34  */
MAYBE_WEAK void SPI1_IRQ_Handler                () { while (1); }   /*  35  */
MAYBE_WEAK void SPI2_IRQ_Handler                () { while (1); }   /*  36  */
MAYBE_WEAK void USART1_IRQ_Handler              () { while (1); }   /*  37  */
MAYBE_WEAK void USART2_IRQ_Handler              () { while (1); }   /*  38  */
MAYBE_WEAK void USART3_IRQ_Handler              () { while (1); }   /*  39  */
MAYBE_WEAK void EXTI15_10_IRQ_Handler           () { while (1); }   /*  40  */
MAYBE_WEAK void RTC_Alarm_IRQ_Handler           () { while (1); }   /*  41  */
MAYBE_WEAK void OTG_FS_WKUP_IRQ_Handler         () { while (1); }   /*  42  */
MAYBE_WEAK void TIM8_BRK_TIM12_IRQ_Handler      () { while (1); }   /*  43  */
MAYBE_WEAK void TIM8_UP_TIM13_IRQ_Handler       () { while (1); }   /*  44  */
MAYBE_WEAK void TIM8_TRG_COM_TIM14_IRQ_Handler  () { while (1); }   /*  45  */
MAYBE_WEAK void TIM8_CC_IRQ_Handler             () { while (1); }   /*  46  */
MAYBE_WEAK void DMA1_Stream7_IRQ_Handler        () { while (1); }   /*  47  */
MAYBE_WEAK void FMC_IRQ_Handler                 () { while (1); }   /*  48  */
MAYBE_WEAK void SDMMC1_IRQ_Handler              () { while (1); }   /*  49  */
MAYBE_WEAK void TIM5_IRQ_Handler                () { while (1); }   /*  50  */
MAYBE_WEAK void SPI3_IRQ_Handler                () { while (1); }   /*  51  */
MAYBE_WEAK void UART4_IRQ_Handler               () { while (1); }   /*  52  */
MAYBE_WEAK void UART5_IRQ_Handler               () { while (1); }   /*  53  */
MAYBE_WEAK void TIM6_DAC_IRQ_Handler            () { while (1); }   /*  54  */
MAYBE_WEAK void TIM7_IRQ_Handler                () { while (1); }   /*  55  */
MAYBE_WEAK void DMA2_Stream0_IRQ_Handler        () { while (1); }   /*  56  */
MAYBE_WEAK void DMA2_Stream1_IRQ_Handler        () { while (1); }   /*  57  */
MAYBE_WEAK void DMA2_Stream2_IRQ_Handler        () { while (1); }   /*  58  */
MAYBE_WEAK void DMA2_Stream3_IRQ_Handler        () { while (1); }   /*  59  */
MAYBE_WEAK void DMA2_Stream4_IRQ_Handler        () { while (1); }   /*  60  */
MAYBE_WEAK void ETH_IRQ_Handler                 () { while (1); }   /*  61  */
MAYBE_WEAK void ETH_WKUP_IRQ_Handler            () { while (1); }   /*  62  */
MAYBE_WEAK void CAN2_TX_IRQ_Handler             () { while (1); }   /*  63  */
MAYBE_WEAK void CAN2_RX0_IRQ_Handler            () { while (1); }   /*  64  */
MAYBE_WEAK void CAN2_RX1_IRQ_Handler            () { while (1); }   /*  65  */
MAYBE_WEAK void CAN2_SCE_IRQ_Handler            () { while (1); }   /*  66  */
MAYBE_WEAK void OTG_FS_IRQ_Handler              () { while (1); }   /*  67  */
MAYBE_WEAK void DMA2_Stream5_IRQ_Handler        () { while (1); }   /*  68  */
MAYBE_WEAK void DMA2_Stream6_IRQ_Handler        () { while (1); }   /*  69  */
MAYBE_WEAK void DMA2_Stream7_IRQ_Handler        () { while (1); }   /*  70  */
MAYBE_WEAK void USART6_IRQ_Handler              () { while (1); }   /*  71  */
MAYBE_WEAK void I2C3_EV_IRQ_Handler             () { while (1); }   /*  72  */
MAYBE_WEAK void I2C3_ER_IRQ_Handler             () { while (1); }   /*  73  */
MAYBE_WEAK void OTG_HS_EP1_OUT_IRQ_Handler      () { while (1); }   /*  74  */
MAYBE_WEAK void OTG_HS_EP1_IN_IRQ_Handler       () { while (1); }   /*  75  */
MAYBE_WEAK void OTG_HS_WKUP_IRQ_Handler         () { while (1); }   /*  76  */
MAYBE_WEAK void OTG_HS_IRQ_Handler              () { while (1); }   /*  77  */
MAYBE_WEAK void DCMI_IRQ_Handler                () { while (1); }   /*  78  */
MAYBE_WEAK void RNG_IRQ_Handler                 () { while (1); }   /*  80  */
MAYBE_WEAK void FPU_IRQ_Handler                 () { while (1); }   /*  81  */
MAYBE_WEAK void UART7_IRQ_Handler               () { while (1); }   /*  82  */
MAYBE_WEAK void UART8_IRQ_Handler               () { while (1); }   /*  83  */
MAYBE_WEAK void SPI4_IRQ_Handler                () { while (1); }   /*  84  */
MAYBE_WEAK void SPI5_IRQ_Handler                () { while (1); }   /*  85  */
MAYBE_WEAK void SPI6_IRQ_Handler                () { while (1); }   /*  86  */
MAYBE_WEAK void SAI1_IRQ_Handler                () { while (1); }   /*  87  */
MAYBE_WEAK void LTDC_IRQ_Handler                () { while (1); }   /*  88  */
MAYBE_WEAK void LTDC_ER_IRQ_Handler             () { while (1); }   /*  89  */
MAYBE_WEAK void DMA2D_IRQ_Handler               () { while (1); }   /*  90  */
MAYBE_WEAK void SAI2_IRQ_Handler                () { while (1); }   /*  91  */
MAYBE_WEAK void QUADSPI_IRQ_Handler             () { while (1); }   /*  92  */
MAYBE_WEAK void LPTIM1_IRQ_Handler              () { while (1); }   /*  93  */
MAYBE_WEAK void CEC_IRQ_Handler                 () { while (1); }   /*  94  */
MAYBE_WEAK void I2C4_EV_IRQ_Handler             () { while (1); }   /*  95  */
MAYBE_WEAK void I2C4_ER_IRQ_Handler             () { while (1); }   /*  96  */
MAYBE_WEAK void SPDIF_RX_IRQ_Handler            () { while (1); }   /*  97  */
MAYBE_WEAK void DFSDM1_FLT0_IRQ_Handler         () { while (1); }   /*  99  */
MAYBE_WEAK void DFSDM1_FLT1_IRQ_Handler         () { while (1); }   /* 100  */
MAYBE_WEAK void DFSDM1_FLT2_IRQ_Handler         () { while (1); }   /* 101  */
MAYBE_WEAK void DFSDM1_FLT3_IRQ_Handler         () { while (1); }   /* 102  */
MAYBE_WEAK void SDMMC2_IRQ_Handler              () { while (1); }   /* 103  */
MAYBE_WEAK void CAN3_TX_IRQ_Handler             () { while (1); }   /* 104  */
MAYBE_WEAK void CAN3_RX0_IRQ_Handler            () { while (1); }   /* 105  */
MAYBE_WEAK void CAN3_RX1_IRQ_Handler            () { while (1); }   /* 106  */
MAYBE_WEAK void CAN3_SCE_IRQ_Handler            () { while (1); }   /* 107  */
MAYBE_WEAK void JPEG_IRQ_Handler                () { while (1); }   /* 108  */
MAYBE_WEAK void MDIOS_IRQ_Handler               () { while (1); }   /* 109  */
#endif  // #ifdef ALL_HANDLERS_DEFAULT
